/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   calc_rayvec.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: user <user@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/05/26 00:42:09 by user              #+#    #+#             */
/*   Updated: 2023/05/26 01:02:44 by user             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../../includes/minirt.h"

t_ray	red_rayvec(t_camera_info *camera_info, double x, double y)
{
	t_vec	eye2scr;
	t_vec	scr2world_ex;
	t_vec	scr2world_ey;
	t_vec	t_ray;
	t_vec	t_rey_n;//ここはt_camera_infoの中の変数でいい気もする

	//視点からスクリーンまでの距離を求める

	//上記からeye2scr(の中心)のベクトルを求める

	//カメラの方向ベクトルを用いてスクリーンのx方向のベクトルを表現する

	//スクリーンのy方向のベクトルをx方向のベクトルとカメラの方向ベクトルの外積で求める

	//t_rayというベクトルを求める（カメラからスクリーン状のある点までのベクトル）

	//t_rayをunit化して返す
}

/******************************^****************^******************************/
/*****************************^ ^**************^ ^*****************************/
/****************************^   ^aaaaaaaaaaaa^   ^****************************/
/**************************c                        c**************************/
/*************************c       @          @       c*************************/
/************************c                            c************************/
/***********************c       ===   |     ===       c************************/
/************************c      ===\__/\__/ ===      c*************************/
/*************************c          \__/           c***********satushi********/
/**************************catcatcatcatcatcatcatcatc***************************/